#!/bin/bash

# (Цветно принтиране) Напишете shell script, който взима два параметъра.
#
# Първият може да е измежду "-r", "-g" "-b", а вторият е произволен string.
# На командата "echo" може да се подаде код на цвят, който ще оцвети текста в определения цвят.
# В зависимост от първия аргумент, изпринтете втория аргумен в определения цвят:
#
# "-r" е червено. Кодът на червеното е '\033[0;31m' (echo -e "\033[0;31m This is red")
# "-g" е зелено. Кодът на зеленото е '\033[0;32m' (echo -e "\033[0;32m This is green")
# "-b" е синьо. Кодът на синьото е '\033[0;34m' (echo -e "\033[0;34m This is blue")
# Ако е подадена друга буква изпишете "Unknown colour", а ако изобщо не е подаден аргумент за цвят, просто изпишете текста.

if [[ $# -lt 1 || $# -gt 2 ]]; then
    echo 'Expected one or two parameters - color and string' >&2
    exit 1
fi

if [[ $# -eq 1 ]]; then
    echo $1
    exit 0
fi

color=""

if [[ "${1}" == "-r" ]]; then
    color="\033[0;31m"
elif [[ "${1}" == "-g" ]]; then
    color="\033[0;32m"
elif [[ "${1}" == "-b" ]]; then
    color="\033[0;34m"
else
    echo 'Unknown colour' >&2
    exit 2
fi

str=$2
echo -e "${color}${str}\033[0m"